Repository: ost4k/EasyUtilities
Catalog: EasyUtilities/Strings/*/Resources.resw
Source language: en_us
Languages: uk_ua

# ui.section.system
source: System
uk_ua: Система

# ui.startup.title
source: Start with Windows
uk_ua: Автозапуск з системою

# ui.startup.desc
source: Run this app automatically at sign-in.
uk_ua: Запускати застосунок при вході в Windows.

# ui.middleClick.title
source: Middle click on title bar
uk_ua: Middle click по заголовку

# ui.middleClick.desc
source: Minimize windows on middle-click in top bar (works for most apps).
uk_ua: Згортати вікна при кліку середньою кнопкою по верхній панелі (для більшості програм).

# ui.hideNames.title
source: Hide shortcut names (experimental)
uk_ua: Приховати назви ярликів (експериментально)

# ui.hideNames.desc
source: Temporarily hides desktop shortcut labels and restores original names when disabled. It is recommended to save desktop icon layout first.
uk_ua: Тимчасово ховає підписи ярликів на робочому столі та відновлює оригінальні назви при вимкненні. Рекомендується спочатку зберегти розкладку робочого столу.

# ui.hideArrows.title
source: Hide internet shortcut arrows
uk_ua: Приховати стрілки інтернет-ярликів

# ui.hideArrows.desc
source: Works only for internet shortcuts (.url). Applies to the current user.
uk_ua: Працює лише для інтернет-ярликів (.url). Застосовується для поточного користувача.

# ui.hideDesktopArrows.title
source: Hide program shortcut arrows (experimental)
uk_ua: Приховати стрілки ярликів програм (експериментально)

# ui.hideDesktopArrows.desc
source: Replaces the program shortcut arrow icon with a transparent one. If arrows are still visible, your Windows build does not support safe shortcut-arrow icon replacement.
uk_ua: Замінює іконку стрілки ярлика програми на прозору. Якщо стрілки залишилися видимими - ваша збірка не підтримує безпечну заміну іконок стрілок ярликів.

# ui.warning.title
source: Warning
uk_ua: Увага

# ui.info.title
source: Information
uk_ua: Інформація

# ui.toggle.enabled
source: Enabled
uk_ua: Увімкнено

# ui.toggle.disabled
source: Disabled
uk_ua: Вимкнено

# ui.hideArrows.warning
source: Restart Explorer after changes.
uk_ua: Після зміни потрібно перезапустити Explorer.

# ui.language.title
source: Language
uk_ua: Мова

# ui.language.desc
source: Change app UI language.
uk_ua: Змінити мову інтерфейсу застосунку.

# ui.language.system
source: System
uk_ua: Системна

# ui.language.uk
source: Ukrainian
uk_ua: Українська

# ui.language.en
source: English
uk_ua: Англійська

# ui.theme.title
source: Theme
uk_ua: Тема

# ui.theme.desc
source: App look: system, light or dark.
uk_ua: Оформлення застосунку: системна, світла або темна.

# ui.theme.system
source: System
uk_ua: Системна

# ui.theme.light
source: Light
uk_ua: Світла

# ui.theme.dark
source: Dark
uk_ua: Темна

# ui.topMost.desc
source: Global option: Ctrl+Alt+T toggles always-on-top for the currently active window in any app.
uk_ua: Глобальна опція: Ctrl+Alt+T вмикає/вимикає always on top для активного вікна будь-якого застосунку.

# ui.ocr.title
source: Text recognition from screen area
uk_ua: Розпізнавання тексту з області екрана

# ui.ocr.desc
source: Hotkey: Ctrl+Alt+O. Select area like Snipping Tool; recognized text is copied to clipboard.
uk_ua: Гаряча клавіша: Ctrl+Alt+O. Відкривається вибір області як у Snipping Tool, потім текст копіюється в буфер.

# ui.restartExplorer.title
source: Restart Explorer
uk_ua: Перезапустити Explorer

# ui.restartExplorer.desc
source: Hotkey: Ctrl+Alt+R. Restarts Windows shell to apply shell-level changes.
uk_ua: Гаряча клавіша: Ctrl+Alt+R. Перезапускає оболонку Windows для застосування shell-змін.

# ui.fileList.title
source: Export file list from Explorer
uk_ua: Список файлів з Explorer

# ui.fileList.desc
source: Hotkey: Ctrl+Alt+F. For the active Explorer folder, export folders and files (including nested items) to clipboard or CSV in the same folder.
uk_ua: Гаряча клавіша: Ctrl+Alt+F. Для активної папки Explorer: експортує папки та файли (включно з вкладеними) у буфер або CSV у тій самій папці.

# ui.fileList.mode.clipboard
source: Clipboard
uk_ua: Буфер обміну

# ui.fileList.mode.csv
source: CSV file in folder
uk_ua: CSV файл у папці

# ui.backup.title
source: Settings backup
uk_ua: Backup налаштувань

# ui.backup.desc
source: Export current settings to a JSON file.
uk_ua: Експортувати поточні параметри у JSON-файл.

# ui.backup.button
source: Save backup
uk_ua: Зберегти backup

# ui.iconsSave.title
source: Save desktop icon layout
uk_ua: Зберегти розкладку значків робочого столу

# ui.iconsSave.desc
source: Export current desktop icon positions to a JSON file.
uk_ua: Експортувати поточні позиції значків робочого столу у JSON-файл.

# ui.iconsSave.button
source: Save layout
uk_ua: Зберегти розкладку

# ui.iconsRestore.title
source: Restore desktop icon layout
uk_ua: Відновити розкладку значків робочого столу

# ui.iconsRestore.desc
source: Import icon positions from a JSON file.
uk_ua: Імпортувати позиції значків із JSON-файлу.

# ui.iconsRestore.button
source: Restore layout
uk_ua: Відновити розкладку

# ui.restore.title
source: Settings restore
uk_ua: Restore налаштувань

# ui.restore.desc
source: Import settings from a JSON file.
uk_ua: Імпортувати налаштування з JSON-файлу.

# ui.restore.button
source: Restore backup
uk_ua: Відновити backup

# app.minimized
source: Running in tray mode.
uk_ua: Працює у фоновому режимі (tray).

# middle.enabled
source: Middle-click minimize enabled.
uk_ua: Middle-click згортання увімкнено.

# middle.disabled
source: Middle-click minimize disabled.
uk_ua: Middle-click згортання вимкнено.

# middle.hook.failed
source: Global middle-click hook failed.
uk_ua: Не вдалося увімкнути глобальний middle-click hook.

# labels.hidden
source: Shortcut labels hidden.
uk_ua: Підписи ярликів приховано.

# labels.restored
source: Shortcut labels restored.
uk_ua: Підписи ярликів відновлено.

# labels.error
source: Label update error
uk_ua: Помилка зміни підписів

# admin.title
source: Administrator rights required
uk_ua: Потрібні права адміністратора

# admin.message
source: The app will restart with UAC for this operation. Continue?
uk_ua: Для цієї операції застосунок буде перезапущено з UAC. Продовжити?

source: Continue
uk_ua: Продовжити

# legacyArrows.migration.title
source: Legacy system-wide setting detected
uk_ua: Виявлено застаріле системне налаштування

# legacyArrows.migration.internet
source: An old machine-wide internet shortcut arrow setting was found. The app will restart with administrator rights once to clean it up. Continue?
uk_ua: Знайдено старе machine-wide налаштування стрілок інтернет-ярликів. Для одноразового очищення застосунок буде перезапущено з правами адміністратора. Продовжити?

# legacyArrows.migration.desktop
source: An old machine-wide desktop shortcut arrow setting was found. The app will restart with administrator rights once to clean it up. Continue?
uk_ua: Знайдено старе machine-wide налаштування стрілок ярликів робочого столу. Для одноразового очищення застосунок буде перезапущено з правами адміністратора. Продовжити?

# legacyArrows.migration.pending
source: Per-user setting was updated, but old machine-wide arrow settings are still active.
uk_ua: Налаштування для поточного користувача оновлено, але старі machine-wide параметри стрілок ще активні.

# legacyArrows.migration.cancel
source: Legacy machine-wide cleanup was cancelled.
uk_ua: Очищення застарілих machine-wide параметрів скасовано.

source: OK
uk_ua: Добре

source: Cancel
uk_ua: Скасувати

# admin.cancel
source: Administrator restart cancelled.
uk_ua: Запуск з правами адміністратора скасовано.

# arrows.updated
source: Shortcut arrow setting updated.
uk_ua: Параметр стрілок ярликів змінено.

# arrows.error
source: Arrow update error
uk_ua: Помилка зміни стрілок

# desktopArrows.enabled.restart
source: Done. To see the changes, Explorer will be restarted now.
uk_ua: Готово. Щоб зміни було видно, зараз перезапустимо Провідник.

# desktopArrows.disabled.restart
source: Done. Shortcut arrows will return after Explorer restarts.
uk_ua: Готово. Стрілки на ярликах повернуться після перезапуску Провідника.

# desktopArrows.compat.warning
source: This Windows build may ignore desktop shortcut arrow hiding. The setting was applied in safe mode without changing shortcut file associations.
uk_ua: Ця збірка Windows може ігнорувати приховування стрілок звичайних ярликів. Налаштування застосовано в безпечному режимі, без зміни системних асоціацій ярликів.

# explorer.title
source: Restart Explorer
uk_ua: Перезапустити Explorer

# explorer.message
source: Explorer restart is required to apply changes.
uk_ua: Щоб застосувати зміни, потрібно перезапустити Explorer.

# explorer.restart
source: Restart now
uk_ua: Перезапустити зараз

source: Explorer restarted.
uk_ua: Explorer перезапущено.

# explorer.error
source: Failed to restart Explorer
uk_ua: Не вдалося перезапустити Explorer

# restart.enabled
source: Ctrl+Alt+R hotkey enabled.
uk_ua: Гаряча клавіша Ctrl+Alt+R увімкнена.

# restart.disabled
source: Ctrl+Alt+R hotkey disabled.
uk_ua: Гаряча клавіша Ctrl+Alt+R вимкнена.

# filelist.enabled
source: File list export enabled (Ctrl+Alt+F).
uk_ua: Експорт списку файлів увімкнено (Ctrl+Alt+F).

# filelist.disabled
source: File list export disabled.
uk_ua: Експорт списку файлів вимкнено.

# filelist.done.clipboard
source: File list copied to clipboard.
uk_ua: Список файлів скопійовано в буфер.

# filelist.done.csv
source: CSV file created:
uk_ua: CSV файл створено:

# filelist.error
source: File list export error
uk_ua: Помилка експорту списку файлів

# ocr.enabled
source: OCR hotkey enabled.
uk_ua: OCR гаряча клавіша увімкнена.

# ocr.disabled
source: OCR hotkey disabled.
uk_ua: OCR гаряча клавіша вимкнена.

# ocr.hotkey.unavailable
source: Ctrl+Alt+O is unavailable because another app already uses this hotkey.
uk_ua: Ctrl+Alt+O недоступна, бо цю комбінацію вже використовує інша програма.

# lang.changed
source: UI language updated.
uk_ua: Мову інтерфейсу змінено.

# ocr.select
source: Select screen area (Win+Shift+S)...
uk_ua: Оберіть область екрана (Win+Shift+S)...

# ocr.empty
source: No text recognized or selection was canceled.
uk_ua: Текст не знайдено або вибір області скасовано.

# ocr.done
source: Text recognized and copied to clipboard.
uk_ua: Текст розпізнано і скопійовано в буфер.

# ocr.error
source: Recognition error
uk_ua: Помилка розпізнавання

# backup.done
source: Backup saved.
uk_ua: Backup збережено.

# icons.save.done
source: Desktop icon layout saved.
uk_ua: Розкладку значків робочого столу збережено.

# icons.restore.done
source: Desktop icon layout restored.
uk_ua: Розкладку значків робочого столу відновлено.

# icons.restore.restart
source: Desktop icon layout restored. Restart Explorer now to apply positions?
uk_ua: Розкладку значків відновлено. Перезапустити Explorer зараз для застосування позицій?

# icons.error
source: Desktop icon layout error
uk_ua: Помилка розкладки значків робочого столу

# restore.bad
source: Invalid backup file.
uk_ua: Некоректний файл backup.

# restore.done
source: Settings restored.
uk_ua: Налаштування відновлено.

# top.on
source: Always on top enabled
uk_ua: Always on top увімкнено

# top.off
source: Always on top disabled
uk_ua: Always on top вимкнено

# top.feature.enabled
source: Global always-on-top hotkey enabled.
uk_ua: Глобальну гарячу клавішу always on top увімкнено.

# top.feature.disabled
source: Global always-on-top hotkey disabled.
uk_ua: Глобальну гарячу клавішу always on top вимкнено.

# top.menu
source: Always on top for this window
uk_ua: Always on top для цього вікна

# startup.adminRequired
source: Administrator rights are required to change shortcut arrows.
uk_ua: Потрібні права адміністратора для зміни стрілок ярликів.

# startup.arrowsAppliedRestart
source: Shortcut arrow settings were applied. Restart Explorer now?
uk_ua: Зміни стрілок ярликів застосовано. Перезапустити Explorer зараз?

# tray.open
source: Open
uk_ua: Відкрити

# tray.exit
source: Exit
uk_ua: Вийти

# dialog.filter.json
source: JSON files (*.json)|*.json|All files (*.*)|*.*
uk_ua: JSON-файли (*.json)|*.json|Усі файли (*.*)|*.*

# backup.errorPrefix
source: Backup error
uk_ua: Помилка backup

# restore.errorPrefix
source: Restore error
uk_ua: Помилка відновлення
